public/cache/hotel/reference_data/90ff30d482c30ec7030ec3871f646c5d_request.dat

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
<soapenv:Header/>
<soapenv:Body>
<hot:HotelDetailsReq xmlns:com="http://www.travelport.com/schema/common_v34_0" xmlns:hot="http://www.travelport.com/schema/hotel_v34_0" ReturnMediaLinks="true" TargetBranch="TRGT_BRCH">
<com:BillingPointOfSaleInfo OriginApplication="UAPI"/>
<hot:HotelProperty HotelChain="HI" HotelCode="43163" Name="HOLIDAY INN SYDNEY AIRPORT"/>
<hot:HotelDetailsModifiers NumberOfAdults="1" RateRuleDetail="Complete">
<com:PermittedProviders>
<com:Provider Code="1G"/>
</com:PermittedProviders>
<hot:HotelStay>
<hot:CheckinDate>2015-12-10</hot:CheckinDate>
<hot:CheckoutDate>2015-12-20</hot:CheckoutDate>
</hot:HotelStay>
</hot:HotelDetailsModifiers>
</hot:HotelDetailsReq>
</soapenv:Body>
</soapenv:Envelope>